/********************************************************/
/*    文件名: Count.C                                   */
/*    功能描述: 将定时器/计数器1设定为计数器，计数器    */
/*              容量为10，每计数到10在P1.0上将取反一次。*/
/********************************************************/

#include "SST89x5x4.h"
sbit P10Value = P1^0;

void main()
{
	TMOD = 0x60;			//设定定时器1计数方式
	TH1 = 0xF6;				//计数初值
	TL1 = 0xF6;
	TR1 = 1;				//启动定时器1
	for(;;)
	{
		while(TF1 == 0);	//判定时器1溢出标志
		P10Value = ~P10Value;
		TF1 = 0;
	}
}
